thesis/gfx/addds.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsdl="http://jbimulti2.iaas.uni-stuttgart.de/wsdl">
   <soapenv:Header>
      <ctxjmu2:TenantContext xmlns:ctxjmu2="http://jbimulti2.iaas.uni-stuttgart.de/tenant-context">
         <ctxjmu2:TenantId>${tenantProperties#taxiCompany-UUID}</ctxjmu2:TenantId>
         <ctxjmu2:UserId>${tenantUserProperties#tenantOperatorA}</ctxjmu2:UserId>
         <ctxjmu2:OptionalEntry>
       	     <ctxjmu2:Key>password</ctxjmu2:Key>
       	     <ctxjmu2:Value>tenantOperatorApw</ctxjmu2:Value>
         </ctxjmu2:OptionalEntry>
      </ctxjmu2:TenantContext>
   </soapenv:Header>
   <soapenv:Body>
      <wsdl:attachDataSource>
         <wsdl:serviceAssemblyName>servicemix.cdasmix.jbi.camel-SA</wsdl:serviceAssemblyName>
         <wsdl:sourceDataSourceName>tenant1tpchaws</wsdl:sourceDataSourceName>
		 <wsdl:sourceDataSourceType>mysql-database-table-5.1.3</wsdl:sourceDataSourceType>
         <wsdl:sourceDataSourceProtocol>mysql</wsdl:sourceDataSourceProtocol>
         <wsdl:sourceDataSourceURL>localhost:3311</wsdl:sourceDataSourceURL>
         <wsdl:targetDataSourceName>tenant1tpchaws</wsdl:targetDataSourceName>
		 <wsdl:targetDataSourceType>mysql-database-table-5.1.3</wsdl:targetDataSourceType>
         <wsdl:targetDataSourceProtocol>mysql</wsdl:targetDataSourceProtocol>
         <wsdl:targetDataSourceURL>tenant1tpchaws.c0giusfeitsw.us-east-1.rds.amazonaws.com:3306/tenant1tpchaws</wsdl:targetDataSourceURL>
         <wsdl:targetDataSourceNativeDriverName>com.mysql.jdbc.Driver</wsdl:targetDataSourceNativeDriverName>
         <wsdl:targetDataSourceUser>tenant1user1tpch</wsdl:targetDataSourceUser>
         <wsdl:targetDataSourcePassword>passwordtenant1user1</wsdl:targetDataSourcePassword>
      </wsdl:attachDataSource>
   </soapenv:Body>
</soapenv:Envelope>